<?php
header('Content-Type: application/json; charset=utf-8');
date_default_timezone_set('Asia/Tokyo');
$hour = (int)date('G'); // 現在の時間を取得（0〜23の整数）
$minute = (int)date('i'); // 現在の分を取得（0〜59の整数）

/** 放送開始時刻（分） */
$liveStartMinute = 0;
if ($minute >= $liveStartMinute) {
    // 放送開始時刻を過ぎている場合は、次の時間帯のプロンプトを使用
    $hour += 1;
}

$filename = $_SERVER['DOCUMENT_ROOT'] . '/prompts/00-ongaku.txt';

$pickupList = [
    "自宅防音室",
    "DTM",
    "VSTプラグイン",
    "Massive/Vital/Nexus論争",
    "打ち込みギターの極意",
    "骨伝導イヤホン",
    "Reaper（DAW）",
    "初音ミク",
    "ボーカロイド",
    "モデリングアンプ",
    "シンセサイザーV",
    "音楽的同位体",
    "ピッチ補正ソフトの綺麗な調声方法とケロケロボイスの出し方",
    "完全打ち込みロックバンド曲の音作り",
    "完全打ち込みEDM曲の音作り",
    "フューチャー・ファンクというジャンルの曲を作ってみよう（古いシティポップやアニソンのリミックス）",
    "完全打ち込み電波系アイドルソングの作り方",
    "完全打ち込みテクノポップの作り方（中田ヤスタカ・パフューム風）",
    "反位相音源によるボーカル除去とノイキャンの仕組み",
    "DTMにおける音空間の広げ方、マスタリングの仕方",
    "アキシブ系とは？概要と歴史を紐解き、アキシブ系楽曲の作り方を学ぼう",
    "無料で使える即戦力VSTプラグイン",
    "電波ソングの作り方",
    "エロゲっぽい曲を作ってみよう",
    "Ample Guitarの使い方",
    "自作イヤホン・スピーカー",
    "オーディオインターフェイス",
    "キャッチーなフレーズ/メロディーの作り方",
    "キャッチーな歌詞の作り方",
    "コード進行は繰り返すべき？せわしなく変化させるべき？論争",
    "今話題のSUNO AIが凄い！使い方を解説",
    "Ace-Step 1.5でローカルAIに音楽を作らせよう",
    "作曲初心者を脱却する簡単な5つのトリック",
    "アニソンを作りたい時のオススメコード進行と、どんな楽器がどんな音を鳴らすとアニソンっぽくなるのかを解説",
    "ボカロをガチで調教してみよう！",
    "打ち込みにおけるアマチュアとプロの違いはどこ？",
    "DTMでの作曲における、レイヤーで音圧を稼ぐ技術",
    "四つ打ちドラム/四分音符コードから脱却したいあなたへ！メロディに合わせてコードの音を抜くには",
    "打ち込み楽曲の引き算の美学",
    "メロディが思いつかない時にやるべき行動",
    "作曲初心者がやりがちなNG行動",
    "かっこいいボーカルチョップの作り方！",
    "プログレッシブハウスの作り方",
];
$randomKeys = array_rand($pickupList, 3);
$pickup = '';
foreach ($randomKeys as $key) {
    $pickup .= "'{$pickupList[$key]}', ";
}

if (file_exists($filename)) {
    $prompt = file_get_contents($filename);
    $prompt = str_replace("<!-- 今日のお題 -->", $pickup, $prompt);

    echo $prompt . "\n\n" . "放送開始時に、時刻は" . $hour . "時になりました。を読み上げてください。";
} else {
    echo "Prompt file not found.";
}